{"candidate": ["Drivers are not required to yield to pedestrians in a crosswalk. False", "Drivers are not required to yield to pedestrians in a crosswalk. True"], "answer": 0, "id": 17395}
{"candidate": ["Blind spots for large vehicles can extend up to 200 feet directly behind the vehicle. False", "Blind spots for large vehicles can extend up to 200 feet directly behind the vehicle. True"], "answer": 1, "id": 96699}
{"candidate": ["When driving in fog a driver should turn on the high-beam headlights to increase the field of vision. True", "When driving in fog a driver should turn on the high-beam headlights to increase the field of vision. False"], "answer": 1, "id": 31531}
{"candidate": ["After a train clears a crossing that has flashing signals, drivers may proceed after checking for a second train on another track and the lights have stopped flashing False", "After a train clears a crossing that has flashing signals, drivers may proceed after checking for a second train on another track and the lights have stopped flashing True"], "answer": 1, "id": 31235}
{"candidate": ["Your car must have a horn that can be heard from a distance of 200 feet. True", "Your car must have a horn that can be heard from a distance of 200 feet. False"], "answer": 0, "id": 31265}
{"candidate": ["You are required to signal anytime you pull away from the curb. True", "You are required to signal anytime you pull away from the curb. False"], "answer": 0, "id": 46231}
{"candidate": ["Without exception, never drive a vehicle through, around or under any railroad gate or barrier False", "Without exception, never drive a vehicle through, around or under any railroad gate or barrier True"], "answer": 1, "id": 17508}
{"candidate": ["The best way to avoid loss of control in wet conditions is to speed up: False", "The best way to avoid loss of control in wet conditions is to speed up: True"], "answer": 0, "id": 16974}
{"candidate": ["A railroad crossbuck sign should be treated the same as a yield sign. True", "A railroad crossbuck sign should be treated the same as a yield sign. False"], "answer": 0, "id": 17414}
{"candidate": ["When approaching a railroad crossing that has no warning signals (such as electric flashing lights or gates), a driver should look, listen and slow down. False", "When approaching a railroad crossing that has no warning signals (such as electric flashing lights or gates), a driver should look, listen and slow down. True"], "answer": 1, "id": 17364}
{"candidate": ["A motorist making a left turn at an intersection should yield to the right-of-way to a bicyclist entering the intersection from the opposite direction. True", "A motorist making a left turn at an intersection should yield to the right-of-way to a bicyclist entering the intersection from the opposite direction. False"], "answer": 0, "id": 46353}
{"candidate": ["It is unlawful to move into the same lane alongside a motorcycle: False", "It is unlawful to move into the same lane alongside a motorcycle: True"], "answer": 1, "id": 97024}
{"candidate": ["If a vehicle starts to skid on water (hydroplane) the driver should quickly apply the brakes. False", "If a vehicle starts to skid on water (hydroplane) the driver should quickly apply the brakes. True"], "answer": 0, "id": 31326}
{"candidate": ["If the front right wheel of a vehicle runs off the pavement, a driver should ease off the accelerator, allow the vehicle to slow down, and gently steer back onto the pavement. False", "If the front right wheel of a vehicle runs off the pavement, a driver should ease off the accelerator, allow the vehicle to slow down, and gently steer back onto the pavement. True"], "answer": 1, "id": 31236}
{"candidate": ["When following a truck at night, it is important to dim your headlights. False", "When following a truck at night, it is important to dim your headlights. True"], "answer": 1, "id": 31446}
{"candidate": ["It is legal for anyone to talk on the phone if using a hands-free device while driving, unless you are under age 19. False", "It is legal for anyone to talk on the phone if using a hands-free device while driving, unless you are under age 19. True"], "answer": 1, "id": 31502}
{"candidate": ["In urban areas, drivers moving out of an alley, building, private road or driveway need not come to a complete stop before entering the roadway if the roadway is clear of traffic True", "In urban areas, drivers moving out of an alley, building, private road or driveway need not come to a complete stop before entering the roadway if the roadway is clear of traffic False"], "answer": 1, "id": 31443}
{"candidate": ["Cell phones can be a serious source of driver distractions True", "Cell phones can be a serious source of driver distractions False"], "answer": 0, "id": 110887}
{"candidate": ["Motorcyclists are entitled to use the full width of a traffic lane; therefore, a driver should pass a motorcycle the same way a driver would pass another vehicle. False", "Motorcyclists are entitled to use the full width of a traffic lane; therefore, a driver should pass a motorcycle the same way a driver would pass another vehicle. True"], "answer": 1, "id": 31384}
{"candidate": ["When a tire goes flat, yo often hear it True", "When a tire goes flat, yo often hear it False"], "answer": 1, "id": 31741}
{"candidate": ["When approaching a four way stop, a motorist arriving at the intersection must yield right-of-way to motorists who arrived before him, waiting his turn to enter the intersection. True", "When approaching a four way stop, a motorist arriving at the intersection must yield right-of-way to motorists who arrived before him, waiting his turn to enter the intersection. False"], "answer": 0, "id": 96818}
{"candidate": ["Drivers must be careful when driving close to cyclist and should maintain a safe operating distance between the motor vehicle and the cyclist. True", "Drivers must be careful when driving close to cyclist and should maintain a safe operating distance between the motor vehicle and the cyclist. False"], "answer": 0, "id": 96603}
{"candidate": ["Slow vehicles should use the left-hand lane except when passing or making a left turn. False", "Slow vehicles should use the left-hand lane except when passing or making a left turn. True"], "answer": 0, "id": 31210}
{"candidate": ["Drivers must yield to pedestrians in an unmarked crosswalk. True", "Drivers must yield to pedestrians in an unmarked crosswalk. False"], "answer": 0, "id": 31178}
{"candidate": ["It is unlawful to move into the same lane alongside a motorcycle. True", "It is unlawful to move into the same lane alongside a motorcycle. False"], "answer": 0, "id": 17338}
{"candidate": ["Your driving privileges will be suspended if you are convicted of illegally passing a stopped school bus. True", "Your driving privileges will be suspended if you are convicted of illegally passing a stopped school bus. False"], "answer": 0, "id": 31205}
{"candidate": ["It is permissible for anyone to wear a headset while driving. False", "It is permissible for anyone to wear a headset while driving. True"], "answer": 0, "id": 31151}
{"candidate": ["Turning left at a red light is never permitted. False", "Turning left at a red light is never permitted. True"], "answer": 0, "id": 65533}
{"candidate": ["Talking or texting on a cell phone while driving will not significantly increase your chances for a crash. False", "Talking or texting on a cell phone while driving will not significantly increase your chances for a crash. True"], "answer": 0, "id": 96933}
{"candidate": ["Drivers may pass on a two-lane roadway marked with a single solid yellow line on their side of the center line. False", "Drivers may pass on a two-lane roadway marked with a single solid yellow line on their side of the center line. True"], "answer": 0, "id": 31271}
{"candidate": ["It is illegal to use a radar detector in Virginia False", "It is illegal to use a radar detector in Virginia True"], "answer": 1, "id": 110675}
{"candidate": ["A driver of a vehicle must stop when approaching a stopped school bus unloading children when on a two-lane road. False", "A driver of a vehicle must stop when approaching a stopped school bus unloading children when on a two-lane road. True"], "answer": 1, "id": 96753}
{"candidate": ["Drivers are required to stop for a stopped school bus when driving on a two-lane road. False", "Drivers are required to stop for a stopped school bus when driving on a two-lane road. True"], "answer": 1, "id": 97003}
{"candidate": ["Only vehicles displaying special plates or parking placards for persons with disabilities may park in spaces reserved for them by an official PARKING FOR PERSONS WITH DISABILITIES sign False", "Only vehicles displaying special plates or parking placards for persons with disabilities may park in spaces reserved for them by an official PARKING FOR PERSONS WITH DISABILITIES sign True"], "answer": 1, "id": 17528}
{"candidate": ["If moving with a stream of vehicles across a railroad track, it is safe to stop on the track for a short period of time. True", "If moving with a stream of vehicles across a railroad track, it is safe to stop on the track for a short period of time. False"], "answer": 1, "id": 31172}
{"candidate": ["A driver that operates a vehicle on South Carolina roadways has already agreed to submit a chemical test or tests when requested by a law enforcement officer. False", "A driver that operates a vehicle on South Carolina roadways has already agreed to submit a chemical test or tests when requested by a law enforcement officer. True"], "answer": 1, "id": 96754}
{"candidate": ["Pedestrians in crosswalks and at intersections have the right-of-way over vehicles. true", "Pedestrians in crosswalks and at intersections have the right-of-way over vehicles. false"], "answer": 0, "id": 46179}
{"candidate": ["If a traffic light shows both a red light and a green arrow, a driver may not turn in the direction of the arrow until the red light has changed. True", "If a traffic light shows both a red light and a green arrow, a driver may not turn in the direction of the arrow until the red light has changed. False"], "answer": 1, "id": 31331}
{"candidate": ["An orange sign means drivers should be alert, adjust their speed and be prepared to stop if necessary. False", "An orange sign means drivers should be alert, adjust their speed and be prepared to stop if necessary. True"], "answer": 1, "id": 31142}
{"candidate": ["Illinois law requires that headlights be on when atmospheric conditions require the use of windshield wipers. True", "Illinois law requires that headlights be on when atmospheric conditions require the use of windshield wipers. False"], "answer": 0, "id": 31418}
{"candidate": ["Work zones on highways have become increasingly safer for workers and drivers. False", "Work zones on highways have become increasingly safer for workers and drivers. True"], "answer": 0, "id": 96937}
{"candidate": ["When driving in snow or ice conditions, it is safe to use your cruise control as long as your speed is reduced. True", "When driving in snow or ice conditions, it is safe to use your cruise control as long as your speed is reduced. False"], "answer": 1, "id": 65722}
{"candidate": ["Vertical driver's licenses are issued to persons over age 21", "Vertical driver's licenses are issued to persons under age 21"], "answer": 1, "id": 110768}
{"candidate": ["When braking you should only use the rear brake True", "When braking you should only use the rear brake False"], "answer": 1, "id": 31682}
{"candidate": ["Drivers are responsible for making sure that children are properly secured in vehicles False", "Drivers are responsible for making sure that children are properly secured in vehicles True"], "answer": 1, "id": 111039}
{"candidate": ["The posted speed limit is the fastest you can drive in the posted area. You must reduce your speed to a lower speed that is safe for the conditions and circumstances that exist whenever necessary. True", "The posted speed limit is the fastest you can drive in the posted area. You must reduce your speed to a lower speed that is safe for the conditions and circumstances that exist whenever necessary. False"], "answer": 0, "id": 35785}
{"candidate": ["A driver does not need to allow as much distance when following a motorcycle as when following a car. True", "A driver does not need to allow as much distance when following a motorcycle as when following a car. False"], "answer": 1, "id": 16948}
{"candidate": ["When approaching a disabled pedestrian using a guide dog, white cane or other assistive device, a driver should yield the right-of-way False", "When approaching a disabled pedestrian using a guide dog, white cane or other assistive device, a driver should yield the right-of-way True"], "answer": 1, "id": 31214}
{"candidate": ["When driving in fog, you should use your high beam headlights: True", "When driving in fog, you should use your high beam headlights: False"], "answer": 1, "id": 96612}
{"candidate": ["When completing an Emergency Roadside Stop, it is not necessary to put on your parking brake. True", "When completing an Emergency Roadside Stop, it is not necessary to put on your parking brake. False"], "answer": 1, "id": 17006}
{"candidate": ["Do not pass a school bus when its red lights are flashing. False", "Do not pass a school bus when its red lights are flashing. True"], "answer": 1, "id": 65563}
{"candidate": ["When approaching a school bus in the opposite direction, which has its stop lights on and the stop arm extended, on a highway that is divided by a median, you should stop. True", "When approaching a school bus in the opposite direction, which has its stop lights on and the stop arm extended, on a highway that is divided by a median, you should stop. False"], "answer": 1, "id": 65724}
{"candidate": ["Regardless of fault, a crash report must be filed by the driver of a vehicle if the crash involves death, bodily injury or property damage of more than $1,500 (or more than $500 if a vehicle is uninsured). False", "Regardless of fault, a crash report must be filed by the driver of a vehicle if the crash involves death, bodily injury or property damage of more than $1,500 (or more than $500 if a vehicle is uninsured). True"], "answer": 1, "id": 31232}
{"candidate": ["Most rear-end collisions are caused by the vehicle in back following too closely. True", "Most rear-end collisions are caused by the vehicle in back following too closely. False"], "answer": 0, "id": 31419}
{"candidate": ["When on a two-lane roadway, a driver must stop their vehicle when approaching a stopped school bus with its red warning lights flashing and stop signal arm extended. True", "When on a two-lane roadway, a driver must stop their vehicle when approaching a stopped school bus with its red warning lights flashing and stop signal arm extended. False"], "answer": 0, "id": 31477}
{"candidate": ["The $500 uninsured motor vehicle fee provides basic liability insurance coverage False", "The $500 uninsured motor vehicle fee provides basic liability insurance coverage True"], "answer": 0, "id": 110707}
{"candidate": ["The three-second rule helps the driver determine a safe following distance. False", "The three-second rule helps the driver determine a safe following distance. True"], "answer": 1, "id": 31294}
{"candidate": ["When driving in fog, you should use your high beam headlights. True", "When driving in fog, you should use your high beam headlights. False"], "answer": 1, "id": 17515}
{"candidate": ["Night time is the safest time for cyclists to ride their bikes. False", "Night time is the safest time for cyclists to ride their bikes. True"], "answer": 0, "id": 96939}
{"candidate": ["Barricades, vertical panels, drums and cones are the most commonly used devices to guide drivers safely through a work zone. True", "Barricades, vertical panels, drums and cones are the most commonly used devices to guide drivers safely through a work zone. False"], "answer": 0, "id": 65934}
{"candidate": ["Highways and roads freeze before ramps and bridges: False", "Highways and roads freeze before ramps and bridges: True"], "answer": 0, "id": 45430}
{"candidate": ["The presence of double yellow lines means you may pass another vehicle from either direction. True", "The presence of double yellow lines means you may pass another vehicle from either direction. False"], "answer": 1, "id": 96945}
{"candidate": ["When driving in fog, you should use your low beam headlights: False", "When driving in fog, you should use your low beam headlights: True"], "answer": 1, "id": 96723}
{"candidate": ["During the Initial Licensing Phase, a teen driver is allowed only two passengers under age 20 in the vehicle during the first 12 months of licensing. True", "During the Initial Licensing Phase, a teen driver is allowed only two passengers under age 20 in the vehicle during the first 12 months of licensing. False"], "answer": 1, "id": 31329}
{"candidate": ["When driving at night, using the parking lights only is unlawful. False", "When driving at night, using the parking lights only is unlawful. True"], "answer": 1, "id": 16921}
{"candidate": ["Before a driver can regain driving privileges after losing them for failure to pay damages caused by a crash, the driver must file proof of financial responsibility with the Secretary of State’s office. True", "Before a driver can regain driving privileges after losing them for failure to pay damages caused by a crash, the driver must file proof of financial responsibility with the Secretary of State’s office. False"], "answer": 0, "id": 31504}
{"candidate": ["There may be times when driving 10 miles per hour is too fast for existing conditions. True", "There may be times when driving 10 miles per hour is too fast for existing conditions. False"], "answer": 0, "id": 16943}
{"candidate": ["If arrested with a blood-alcohol concentration of .08 percent or more, an individual's driving privileges will be suspended for at least six months. False", "If arrested with a blood-alcohol concentration of .08 percent or more, an individual's driving privileges will be suspended for at least six months. True"], "answer": 1, "id": 31234}
{"candidate": ["When driving from a private road or driveway, you do not have to stop before crossing a sidewalk False", "When driving from a private road or driveway, you do not have to stop before crossing a sidewalk True"], "answer": 0, "id": 110949}
{"candidate": ["Headlights must be lighted from sunset to sunrise. False", "Headlights must be lighted from sunset to sunrise. True"], "answer": 1, "id": 31328}
{"candidate": ["A driver whose license has been revoked as a result of DUI must meet several requirements, including an evaluation for alcohol and drug problems and paying a reinstatement fee, to regain their license. True", "A driver whose license has been revoked as a result of DUI must meet several requirements, including an evaluation for alcohol and drug problems and paying a reinstatement fee, to regain their license. False"], "answer": 0, "id": 31141}
{"candidate": ["Cellphone use while driving is permitted as long as the driver is using a hands-free device. False", "Cellphone use while driving is permitted as long as the driver is using a hands-free device. True"], "answer": 1, "id": 31447}
{"candidate": ["When waiting at an intersection and the traffic signal light turns green, a driver should look to the left and then right before proceeding into the intersection. False", "When waiting at an intersection and the traffic signal light turns green, a driver should look to the left and then right before proceeding into the intersection. True"], "answer": 1, "id": 31356}
{"candidate": ["Any motor vehicle operator convicted of fleeing in order to avoid arrest for the violation of any Nebraska law can have their license revoked False", "Any motor vehicle operator convicted of fleeing in order to avoid arrest for the violation of any Nebraska law can have their license revoked True"], "answer": 1, "id": 65865}
{"candidate": ["A driver may pass another vehicle by driving on the shoulder of the road. True", "A driver may pass another vehicle by driving on the shoulder of the road. False"], "answer": 1, "id": 31295}
{"candidate": ["It is permissible to make a right turn against a red signal light after stopping and yielding to other vehicles and pedestrians. True", "It is permissible to make a right turn against a red signal light after stopping and yielding to other vehicles and pedestrians. False"], "answer": 0, "id": 31415}
{"candidate": ["Motorcyclists are entitled to use the full width of a traffic lane; therefore, a driver should pass a motorcycle the same way as passing another vehicle. True", "Motorcyclists are entitled to use the full width of a traffic lane; therefore, a driver should pass a motorcycle the same way as passing another vehicle. False"], "answer": 0, "id": 31174}
{"candidate": ["Yield also means stop if you cannot merge safely into the flow of traffic True", "Yield also means stop if you cannot merge safely into the flow of traffic False"], "answer": 0, "id": 16989}
{"candidate": ["Drivers are not required to stop upon meeting a stopped school bus when traveling in the opposite direction on a multi-lane highway. False", "Drivers are not required to stop upon meeting a stopped school bus when traveling in the opposite direction on a multi-lane highway. True"], "answer": 1, "id": 96542}
{"candidate": ["Orange is the basic color of signs used in construction work zones to alert drivers. True", "Orange is the basic color of signs used in construction work zones to alert drivers. False"], "answer": 0, "id": 35788}
{"candidate": ["When an authorized vehicle using its sirens and flashing lights approaches a vehicle, the driver should pull to the right-hand edge of the roadway and wait for the emergency vehicle to pass. False", "When an authorized vehicle using its sirens and flashing lights approaches a vehicle, the driver should pull to the right-hand edge of the roadway and wait for the emergency vehicle to pass. True"], "answer": 1, "id": 31293}
{"candidate": ["You must use your headlights whenever you use your windshield wipers as a result of bad weather False", "You must use your headlights whenever you use your windshield wipers as a result of bad weather True"], "answer": 1, "id": 110706}
{"candidate": ["It is legal to transport children under age 16 in the bed of a pick-up truck if it is equipped with a camper shell False", "It is legal to transport children under age 16 in the bed of a pick-up truck if it is equipped with a camper shell True"], "answer": 0, "id": 111034}
{"candidate": ["You do not have to stop for a school bus that is stopped with its red lights flashing if it is on a private road: True", "You do not have to stop for a school bus that is stopped with its red lights flashing if it is on a private road: False"], "answer": 1, "id": 35757}
{"candidate": ["When following a vehicle at night it is important to dim your headlights False", "When following a vehicle at night it is important to dim your headlights True"], "answer": 1, "id": 31414}
{"candidate": ["A merge sign means drivers should be prepared to change lanes or allow other traffic to come into their lane. False", "A merge sign means drivers should be prepared to change lanes or allow other traffic to come into their lane. True"], "answer": 1, "id": 31147}
{"candidate": ["Because driving involves some risk, it is wise to continually improve your driving and observation skills. True", "Because driving involves some risk, it is wise to continually improve your driving and observation skills. False"], "answer": 0, "id": 17099}
{"candidate": ["When driving through a neighborhood, the speed limit is usually 30 mph. True", "When driving through a neighborhood, the speed limit is usually 30 mph. False"], "answer": 0, "id": 97091}
{"candidate": ["A driver who becomes stranded in blizzard conditions should remain in their vehicle. False", "A driver who becomes stranded in blizzard conditions should remain in their vehicle. True"], "answer": 1, "id": 31354}
{"candidate": ["After making a proper stop and yielding to traffic or pedestrians within the intersection, it is permissible for drivers on a one-way street to turn left at a red light onto another one-way street that moves traffic to the left. False", "After making a proper stop and yielding to traffic or pedestrians within the intersection, it is permissible for drivers on a one-way street to turn left at a red light onto another one-way street that moves traffic to the left. True"], "answer": 1, "id": 31155}
{"candidate": ["Children up to age eighteen are prohibited from riding in cargo areas. False", "Children up to age eighteen are prohibited from riding in cargo areas. True"], "answer": 1, "id": 65603}
{"candidate": ["T/F Motorcycle drivers must wear a helmet True", "T/F Motorcycle drivers must wear a helmet False"], "answer": 1, "id": 31563}
{"candidate": ["A driver must give the right or left turn signal when changing lanes. True", "A driver must give the right or left turn signal when changing lanes. False"], "answer": 1, "id": 31361}
{"candidate": ["Driving privileges may be revoked for giving false information to the Secretary of State. True", "Driving privileges may be revoked for giving false information to the Secretary of State. False"], "answer": 0, "id": 31442}
{"candidate": ["After being pulled over by law enforcement, a driver should immediately exit the vehicle and quickly approach the officer’s squad car. False", "After being pulled over by law enforcement, a driver should immediately exit the vehicle and quickly approach the officer’s squad car. True"], "answer": 0, "id": 31212}
{"candidate": ["A parent or legal guardian may request that the driver’s license of a minor be cancelled at any time prior to age 18. True", "A parent or legal guardian may request that the driver’s license of a minor be cancelled at any time prior to age 18. False"], "answer": 0, "id": 31208}
{"candidate": ["T/F In Illinois, a person with a BAC of .1 is considered intoxicated. True", "T/F In Illinois, a person with a BAC of .1 is considered intoxicated. False"], "answer": 1, "id": 31685}
{"candidate": ["If driving in fog, a driver should turn on the high-beam headlights to increase the field of vision. False", "If driving in fog, a driver should turn on the high-beam headlights to increase the field of vision. True"], "answer": 0, "id": 16917}
{"candidate": ["Motorists are not required to yield to pedestrians when they walk against the traffic light: True.", "Motorists are not required to yield to pedestrians when they walk against the traffic light: False."], "answer": 1, "id": 96845}
{"candidate": ["A person riding a bicycle has all the same rights, responsibilities and must obey traffic laws as a driver of a motor True", "A person riding a bicycle has all the same rights, responsibilities and must obey traffic laws as a driver of a motor False"], "answer": 0, "id": 65721}
{"candidate": ["In order to obtain court supervision for a traffic violation, a minor must appear in court with a parent/legal guardian and attend a traffic safety school. False", "In order to obtain court supervision for a traffic violation, a minor must appear in court with a parent/legal guardian and attend a traffic safety school. True"], "answer": 1, "id": 31360}
{"candidate": ["T/F Motorcycle pasengers must wear a helmet False", "T/F Motorcycle pasengers must wear a helmet True"], "answer": 0, "id": 31623}
{"candidate": ["It is legal to go faster than the speed limit when passing another vehicle. True", "It is legal to go faster than the speed limit when passing another vehicle. False"], "answer": 1, "id": 65897}
{"candidate": ["A driver that operates a vehicle on Nebraska roadways has already agreed to submit a chemical test or tests when requested by a law enforcement officer. True", "A driver that operates a vehicle on Nebraska roadways has already agreed to submit a chemical test or tests when requested by a law enforcement officer. False"], "answer": 0, "id": 66073}
{"candidate": ["When passing another vehicle, a driver should wait until the entire car the driver just passed is visible in the rearview mirror before turning back into the right-hand lane. True", "When passing another vehicle, a driver should wait until the entire car the driver just passed is visible in the rearview mirror before turning back into the right-hand lane. False"], "answer": 0, "id": 17354}
{"candidate": ["At intersections with four-way stops, the driver on the right should insist on the right-of-way. False", "At intersections with four-way stops, the driver on the right should insist on the right-of-way. True"], "answer": 0, "id": 65900}
{"candidate": ["If you are involved in or come upon a traffic crash, you should stop your vehicle in a safe, well-lighted public place that does not obstruct traffic, if able to do so. False", "If you are involved in or come upon a traffic crash, you should stop your vehicle in a safe, well-lighted public place that does not obstruct traffic, if able to do so. True"], "answer": 1, "id": 31387}
{"candidate": ["It is unlawful to operate a motor vehicle upon any public roadway, when such vehicle is equipped with a viewing screen that is visible to the driver. True", "It is unlawful to operate a motor vehicle upon any public roadway, when such vehicle is equipped with a viewing screen that is visible to the driver. False"], "answer": 0, "id": 66015}
{"candidate": ["It is illegal for persons under age 21 to drive with any trace of alcohol or drugs in their system. True", "It is illegal for persons under age 21 to drive with any trace of alcohol or drugs in their system. False"], "answer": 0, "id": 31292}
{"candidate": ["A person riding a bicycle has all the same rights and responsibilities and must obey traffic laws as a driver of a motor vehicle. False", "A person riding a bicycle has all the same rights and responsibilities and must obey traffic laws as a driver of a motor vehicle. True"], "answer": 1, "id": 97027}
{"candidate": ["How fast you drive will not affect the distance your vehicle will travel when you need to come to a stop. False", "How fast you drive will not affect the distance your vehicle will travel when you need to come to a stop. True"], "answer": 0, "id": 96787}
{"candidate": ["A driver of a vehicle need not stop upon meeting a stopped school bus when traveling in the opposite direction on a multi-lane highway or multi-lane private road. True", "A driver of a vehicle need not stop upon meeting a stopped school bus when traveling in the opposite direction on a multi-lane highway or multi-lane private road. False"], "answer": 0, "id": 97028}
{"candidate": ["Drivers may open car doors on the side on which traffic is moving only when it can be done safely and without interfering with traffic. True", "Drivers may open car doors on the side on which traffic is moving only when it can be done safely and without interfering with traffic. False"], "answer": 0, "id": 31175}
{"candidate": ["A motorist making a left turn at an intersection should yield the right-of-way to a bicyclist entering the intersection from the opposite direction. True", "A motorist making a left turn at an intersection should yield the right-of-way to a bicyclist entering the intersection from the opposite direction. False"], "answer": 0, "id": 96634}
{"candidate": ["The road surface of a bridge may be dangerous in winter because it may remain icy after the rest of the roadway is clear. True", "The road surface of a bridge may be dangerous in winter because it may remain icy after the rest of the roadway is clear. False"], "answer": 0, "id": 31238}
{"candidate": ["The most common mistake that drivers make when backing is failing to look both ways behind them True", "The most common mistake that drivers make when backing is failing to look both ways behind them False"], "answer": 0, "id": 45844}
{"candidate": ["While driving at night, you may use your parking lights instead of headlights. True", "While driving at night, you may use your parking lights instead of headlights. False"], "answer": 1, "id": 46235}
