{"candidate": ["If you are applying for a Class B CDL, you will be required One, three of the One, three versions of a pre-trip inspection in the vehicle you have brought with you for testing.", "If you are applying for a Class B CDL, you will be required Two, three. of the Two, three. versions of a pre-trip inspection in the vehicle you have brought with you for testing.", "If you are applying for a Class B CDL, you will be required One, five of the One, five versions of a pre-trip inspection in the vehicle you have brought with you for testing.", "If you are applying for a Class B CDL, you will be required Three, three of the Three, three versions of a pre-trip inspection in the vehicle you have brought with you for testing.", "If you are applying for a Class B CDL, you will be required Two, four. of the Two, four. versions of a pre-trip inspection in the vehicle you have brought with you for testing."], "answer": 0, "id": 2324}
{"candidate": ["As you are checking your hydraulic brakes, you should pump the brake pedal three times and then hold it for how many seconds? 10 seconds.", "As you are checking your hydraulic brakes, you should pump the brake pedal three times and then hold it for how many seconds? 23 seconds.", "As you are checking your hydraulic brakes, you should pump the brake pedal three times and then hold it for how many seconds? 5 seconds.", "As you are checking your hydraulic brakes, you should pump the brake pedal three times and then hold it for how many seconds? 15 seconds.", "As you are checking your hydraulic brakes, you should pump the brake pedal three times and then hold it for how many seconds? 30 seconds."], "answer": 2, "id": 1628}
{"candidate": ["Why should you cover your cargo during its transportation? To protect the cargo from weather only.", "Why should you cover your cargo during its transportation? There is no reason.", "Why should you cover your cargo during its transportation? To protect people (pedestrians, passengers and other civilians) from the cargo's contents if it spills.", "Why should you cover your cargo during its transportation? To protect people (pedestrians, passengers and other civilians) from the cargo's contents if it spills and to protect the cargo from weather.", "Why should you cover your cargo during its transportation? To help your vehicle accelerate smoothly."], "answer": 3, "id": 1470}
{"candidate": ["The parking brake valve should close when the air pressure falls into what range? 100-125 psi.", "The parking brake valve should close when the air pressure falls into what range? 70- 85 psi.", "The parking brake valve should close when the air pressure falls into what range? 90-95 psi.", "The parking brake valve should close when the air pressure falls into what range? 100-110 psi.", "The parking brake valve should close when the air pressure falls into what range? 20-45 psi."], "answer": 4, "id": 1317}
{"candidate": ["Why should you start, slow down and stop smoothly when driving a liquid tanker? The expensive price of gas.", "Why should you start, slow down and stop smoothly when driving a liquid tanker? The high center of gravity.", "Why should you start, slow down and stop smoothly when driving a liquid tanker? The liquid surge and the high center of gravity.", "Why should you start, slow down and stop smoothly when driving a liquid tanker? The liquid surge.", "Why should you start, slow down and stop smoothly when driving a liquid tanker? The bottom-heaviness of liquid tankers."], "answer": 2, "id": 2176}
{"candidate": ["When will you lose your CDL for life? If you have committed a serious traffic violation.", "When will you lose your CDL for life? If you use a CMV to commit a felony involving controlled substances.", "When will you lose your CDL for life? If you leave the scene of an accident involving a CMV for the first time.", "When will you lose your CDL for life? If you use a CMV to commit a felony involving controlled substances or if you commit an alcohol-related offense for the second time.", "When will you lose your CDL for life? If you commit an alcohol-related offense for the second time."], "answer": 3, "id": 2481}
{"candidate": ["What is the minimum number of days you can lose your CDL if you have committed three serious traffic violations within a three-year period involving a CMV? 60 days.", "What is the minimum number of days you can lose your CDL if you have committed three serious traffic violations within a three-year period involving a CMV? 90 days.", "What is the minimum number of days you can lose your CDL if you have committed three serious traffic violations within a three-year period involving a CMV? 120 days.", "What is the minimum number of days you can lose your CDL if you have committed three serious traffic violations within a three-year period involving a CMV? 30 days.", "What is the minimum number of days you can lose your CDL if you have committed three serious traffic violations within a three-year period involving a CMV? 45 days."], "answer": 2, "id": 1525}
{"candidate": ["When transporting cargo tanks, you should stop 50, 100 to 50, 100 ft. before the nearest rail of a railroad.", "When transporting cargo tanks, you should stop 5/10/2016 to 5/10/2016 ft. before the nearest rail of a railroad.", "When transporting cargo tanks, you should stop 15, 50 to 15, 50 ft. before the nearest rail of a railroad.", "When transporting cargo tanks, you should stop 60, 75 to 60, 75 ft. before the nearest rail of a railroad.", "When transporting cargo tanks, you should stop 25, 35 to 25, 35 ft. before the nearest rail of a railroad."], "answer": 2, "id": 1709}
{"candidate": ["The tractor protection valve should go from \"normal\" to \"emergency\" position when the air pressure falls into what range? 75-85 psi.", "The tractor protection valve should go from \"normal\" to \"emergency\" position when the air pressure falls into what range? 20-45 psi.", "The tractor protection valve should go from \"normal\" to \"emergency\" position when the air pressure falls into what range? 100-125 psi.", "The tractor protection valve should go from \"normal\" to \"emergency\" position when the air pressure falls into what range? 65-90 psi.", "The tractor protection valve should go from \"normal\" to \"emergency\" position when the air pressure falls into what range? 50-60 psi."], "answer": 1, "id": 1387}
{"candidate": ["When you are transporting cargo, you should inspect your cargo within the first 25 miles.", "When you are transporting cargo, you should inspect your cargo within the first 45 miles.", "When you are transporting cargo, you should inspect your cargo within the first 30 miles.", "When you are transporting cargo, you should inspect your cargo within the first 50 miles.", "When you are transporting cargo, you should inspect your cargo within the first 20 miles."], "answer": 3, "id": 1258}
{"candidate": ["You will lose your CDL for at least 120 days. if you have committed two violations of an \"out-of-service order\" in a ten-year period.", "You will lose your CDL for at least 90 days. if you have committed two violations of an \"out-of-service order\" in a ten-year period.", "You will lose your CDL for at least 9 months. if you have committed two violations of an \"out-of-service order\" in a ten-year period.", "You will lose your CDL for at least 60 days. if you have committed two violations of an \"out-of-service order\" in a ten-year period.", "You will lose your CDL for at least One year. if you have committed two violations of an \"out-of-service order\" in a ten-year period."], "answer": 4, "id": 2464}
{"candidate": ["Bus drivers cannot carry more than 25 lbs. of solid Class 6 poisons.", "Bus drivers cannot carry more than 100 lbs. of solid Class 6 poisons.", "Bus drivers cannot carry more than 50 lbs. of solid Class 6 poisons.", "Bus drivers cannot carry more than 75 lbs. of solid Class 6 poisons.", "Bus drivers cannot carry more than 15 lbs. of solid Class 6 poisons."], "answer": 1, "id": 2264}
{"candidate": ["The blind spot of a school bus can extend up to how many feet? 450 ft.", "The blind spot of a school bus can extend up to how many feet? 400 ft.", "The blind spot of a school bus can extend up to how many feet? 600", "The blind spot of a school bus can extend up to how many feet? 550 ft.", "The blind spot of a school bus can extend up to how many feet? 500 ft."], "answer": 1, "id": 2225}
{"candidate": ["How do you typically control the extra gears provided by the multi-speed rear axles and auxiliary transmissions? Lever.", "How do you typically control the extra gears provided by the multi-speed rear axles and auxiliary transmissions? Switch.", "How do you typically control the extra gears provided by the multi-speed rear axles and auxiliary transmissions? A selector knob.", "How do you typically control the extra gears provided by the multi-speed rear axles and auxiliary transmissions? Wig wag.", "How do you typically control the extra gears provided by the multi-speed rear axles and auxiliary transmissions? Selector knob or switch."], "answer": 4, "id": 1693}
{"candidate": ["Typically, identification numbers are Six. digit codes.", "Typically, identification numbers are Five. digit codes.", "Typically, identification numbers are Three. digit codes.", "Typically, identification numbers are Four. digit codes.", "Typically, identification numbers are Eight. digit codes."], "answer": 3, "id": 2084}
{"candidate": ["If you are always required to stop at a railroad crossing and you do not stop before driving into the crossing, you can lose your CDL for at least 120 days. if it is your third similar violation within a three-year period.", "If you are always required to stop at a railroad crossing and you do not stop before driving into the crossing, you can lose your CDL for at least 90 days. if it is your third similar violation within a three-year period.", "If you are always required to stop at a railroad crossing and you do not stop before driving into the crossing, you can lose your CDL for at least 360 days. if it is your third similar violation within a three-year period.", "If you are always required to stop at a railroad crossing and you do not stop before driving into the crossing, you can lose your CDL for at least 60 days. if it is your third similar violation within a three-year period.", "If you are always required to stop at a railroad crossing and you do not stop before driving into the crossing, you can lose your CDL for at least 45 days. if it is your third similar violation within a three-year period."], "answer": 2, "id": 1686}
{"candidate": ["While driving a combination vehicle, you should follow at least 1 second, 5 ft. second for each 1 second, 5 ft. ft. of your vehicle length.", "While driving a combination vehicle, you should follow at least 2 seconds, 8 ft. second for each 2 seconds, 8 ft. ft. of your vehicle length.", "While driving a combination vehicle, you should follow at least 1 second, 10 ft. second for each 1 second, 10 ft. ft. of your vehicle length.", "While driving a combination vehicle, you should follow at least 3 seconds, 5 ft. second for each 3 seconds, 5 ft. ft. of your vehicle length.", "While driving a combination vehicle, you should follow at least 2 seconds, 5 ft. second for each 2 seconds, 5 ft. ft. of your vehicle length."], "answer": 2, "id": 1911}
{"candidate": ["Every 4 hours (or 150 miles, whichever comes first) you should check to ensure your cargo is secure.", "Every 2 hours (or 150 miles, whichever comes first) you should check to ensure your cargo is secure.", "Every 6 hours (or 150 miles, whichever comes first) you should check to ensure your cargo is secure.", "Every 5 hours (or 150 miles, whichever comes first) you should check to ensure your cargo is secure.", "Every 3 hours (or 150 miles, whichever comes first) you should check to ensure your cargo is secure."], "answer": 4, "id": 1731}
{"candidate": ["If the school bus is so equipped, the school bus driver should activate the bus' alternating flashing amber warning lights in accordance with state law or at least 100 ft. before the school bus stop.", "If the school bus is so equipped, the school bus driver should activate the bus' alternating flashing amber warning lights in accordance with state law or at least 600 ft. before the school bus stop.", "If the school bus is so equipped, the school bus driver should activate the bus' alternating flashing amber warning lights in accordance with state law or at least 200 ft. before the school bus stop.", "If the school bus is so equipped, the school bus driver should activate the bus' alternating flashing amber warning lights in accordance with state law or at least 500 ft. before the school bus stop.", "If the school bus is so equipped, the school bus driver should activate the bus' alternating flashing amber warning lights in accordance with state law or at least 25 ft. before the school bus stop."], "answer": 2, "id": 2250}
{"candidate": ["The tractor protection valve and parking brake valve of a tractor-trailer combination vehicle should pop out at 100 psi..", "The tractor protection valve and parking brake valve of a tractor-trailer combination vehicle should pop out at 120 psi..", "The tractor protection valve and parking brake valve of a tractor-trailer combination vehicle should pop out at 40 psi..", "The tractor protection valve and parking brake valve of a tractor-trailer combination vehicle should pop out at 85 psi..", "The tractor protection valve and parking brake valve of a tractor-trailer combination vehicle should pop out at 70 psi.."], "answer": 2, "id": 1684}
{"candidate": ["Placards should be what size? 10 3/4 inches.", "Placards should be what size? 13 inches.", "Placards should be what size? 9 inches.", "Placards should be what size? 8 1/2 inches.", "Placards should be what size? 5 1/4 inches."], "answer": 0, "id": 1501}
{"candidate": ["You should start, slow down and stop very smoothly while driving in a liquid tanker because The bottom-heaviness of liquid tankers..", "You should start, slow down and stop very smoothly while driving in a liquid tanker because The liquid surge and the high center of gravity..", "You should start, slow down and stop very smoothly while driving in a liquid tanker because The expensive price of gas..", "You should start, slow down and stop very smoothly while driving in a liquid tanker because The liquid surge..", "You should start, slow down and stop very smoothly while driving in a liquid tanker because The high center of gravity.."], "answer": 1, "id": 2416}
{"candidate": ["If you have committed three serious traffic violations within a three-year period involving a CMV, you will likely lose your CDL at least 90 days.", "If you have committed three serious traffic violations within a three-year period involving a CMV, you will likely lose your CDL at least 45 days.", "If you have committed three serious traffic violations within a three-year period involving a CMV, you will likely lose your CDL at least 30 days.", "If you have committed three serious traffic violations within a three-year period involving a CMV, you will likely lose your CDL at least 60 days.", "If you have committed three serious traffic violations within a three-year period involving a CMV, you will likely lose your CDL at least 120 days."], "answer": 4, "id": 1463}
{"candidate": ["Failing to slow down and check that the tracks are clear of an approaching train can result in you losing your CDL for at least 60 days. for your first violation.", "Failing to slow down and check that the tracks are clear of an approaching train can result in you losing your CDL for at least 90 days. for your first violation.", "Failing to slow down and check that the tracks are clear of an approaching train can result in you losing your CDL for at least 120 days. for your first violation.", "Failing to slow down and check that the tracks are clear of an approaching train can result in you losing your CDL for at least 45 days. for your first violation.", "Failing to slow down and check that the tracks are clear of an approaching train can result in you losing your CDL for at least 360 days. for your first violation."], "answer": 0, "id": 1289}
{"candidate": ["Trailers built before 1992 are not required to have spring brakes.", "Trailers built before 1995 are not required to have spring brakes.", "Trailers built before 1975 are not required to have spring brakes.", "Trailers built before 1987 are not required to have spring brakes.", "Trailers built before 2011 are not required to have spring brakes."], "answer": 2, "id": 1243}
{"candidate": ["You will lose your CDL for at least 30 days if you have committed three serious traffic violations within a three-year period involving a CMV.", "You will lose your CDL for at least 45 days if you have committed three serious traffic violations within a three-year period involving a CMV.", "You will lose your CDL for at least 90 days if you have committed three serious traffic violations within a three-year period involving a CMV.", "You will lose your CDL for at least 60 days if you have committed three serious traffic violations within a three-year period involving a CMV.", "You will lose your CDL for at least 120 days if you have committed three serious traffic violations within a three-year period involving a CMV."], "answer": 4, "id": 1407}
{"candidate": ["How many digits are identification numbers of hazardous materials? Six.", "How many digits are identification numbers of hazardous materials? Three.", "How many digits are identification numbers of hazardous materials? Eight.", "How many digits are identification numbers of hazardous materials? Ten.", "How many digits are identification numbers of hazardous materials? Four."], "answer": 4, "id": 2190}
{"candidate": ["It's important that a warning signal comes on before the air pressure in the tank falls below 90 psi..", "It's important that a warning signal comes on before the air pressure in the tank falls below 60 psi..", "It's important that a warning signal comes on before the air pressure in the tank falls below 100 psi..", "It's important that a warning signal comes on before the air pressure in the tank falls below 120 psi..", "It's important that a warning signal comes on before the air pressure in the tank falls below 125 psi.."], "answer": 1, "id": 1350}
{"candidate": ["In column 1 of the Hazardous Materials Table, the \"I\" symbol indicates Internal transportation..", "In column 1 of the Hazardous Materials Table, the \"I\" symbol indicates Identification..", "In column 1 of the Hazardous Materials Table, the \"I\" symbol indicates Interstate..", "In column 1 of the Hazardous Materials Table, the \"I\" symbol indicates International transportation..", "In column 1 of the Hazardous Materials Table, the \"I\" symbol indicates Inside.."], "answer": 3, "id": 1666}
{"candidate": ["The The parking brake. can be used to slow the vehicle while you are driving down a hill.", "The The vehicle's horn. can be used to slow the vehicle while you are driving down a hill.", "The The emergency brake. can be used to slow the vehicle while you are driving down a hill.", "The The parking brake or the emergency brake. can be used to slow the vehicle while you are driving down a hill.", "The The accelerator. can be used to slow the vehicle while you are driving down a hill."], "answer": 3, "id": 1257}
{"candidate": ["If you have committed two violations of an \"out-of-service order\" in a ten-year period, you will likely lose your CDL for what amount of time? One year.", "If you have committed two violations of an \"out-of-service order\" in a ten-year period, you will likely lose your CDL for what amount of time? 60 days.", "If you have committed two violations of an \"out-of-service order\" in a ten-year period, you will likely lose your CDL for what amount of time? 120 days.", "If you have committed two violations of an \"out-of-service order\" in a ten-year period, you will likely lose your CDL for what amount of time? 90 days.", "If you have committed two violations of an \"out-of-service order\" in a ten-year period, you will likely lose your CDL for what amount of time? 9 months."], "answer": 0, "id": 1435}
{"candidate": ["When checking your hydraulic brakes, pump the brake pedal three times and make sure you hold it down for 5 seconds.. The brake pedal should not depress during this time.", "When checking your hydraulic brakes, pump the brake pedal three times and make sure you hold it down for 10 seconds.. The brake pedal should not depress during this time.", "When checking your hydraulic brakes, pump the brake pedal three times and make sure you hold it down for 23 seconds.. The brake pedal should not depress during this time.", "When checking your hydraulic brakes, pump the brake pedal three times and make sure you hold it down for 30 seconds.. The brake pedal should not depress during this time.", "When checking your hydraulic brakes, pump the brake pedal three times and make sure you hold it down for 15 seconds.. The brake pedal should not depress during this time."], "answer": 0, "id": 1528}
{"candidate": ["When you are transporting cargo, you should check your cargo is secure every 50 miles.", "When you are transporting cargo, you should check your cargo is secure every 75 miles.", "When you are transporting cargo, you should check your cargo is secure every 250 miles.", "When you are transporting cargo, you should check your cargo is secure every 150 miles.", "When you are transporting cargo, you should check your cargo is secure every 225 miles."], "answer": 3, "id": 1436}
{"candidate": ["If the outside right side flat mirror is adjusted properly, you be able to see 200 ft. behind the bus.", "If the outside right side flat mirror is adjusted properly, you be able to see 250 ft. behind the bus.", "If the outside right side flat mirror is adjusted properly, you be able to see 350 ft. behind the bus.", "If the outside right side flat mirror is adjusted properly, you be able to see 300 ft. behind the bus.", "If the outside right side flat mirror is adjusted properly, you be able to see 400 ft. behind the bus."], "answer": 0, "id": 2278}
{"candidate": ["Bus drivers should not carry more than 500 lbs. lbs. total of allowed hazardous materials.", "Bus drivers should not carry more than 100 lbs. lbs. total of allowed hazardous materials.", "Bus drivers should not carry more than 250 lbs. lbs. total of allowed hazardous materials.", "Bus drivers should not carry more than 50 lbs. lbs. total of allowed hazardous materials.", "Bus drivers should not carry more than 25 lbs. lbs. total of allowed hazardous materials."], "answer": 0, "id": 1763}
{"candidate": ["Bus drivers can carry small amounts of certain hazardous materials. However, the total amount of hazardous materials should not exceed what amount? 25 lbs.", "Bus drivers can carry small amounts of certain hazardous materials. However, the total amount of hazardous materials should not exceed what amount? 250 lbs.", "Bus drivers can carry small amounts of certain hazardous materials. However, the total amount of hazardous materials should not exceed what amount? 100 lbs.", "Bus drivers can carry small amounts of certain hazardous materials. However, the total amount of hazardous materials should not exceed what amount? 500 lbs.", "Bus drivers can carry small amounts of certain hazardous materials. However, the total amount of hazardous materials should not exceed what amount? 50 lbs."], "answer": 3, "id": 2323}
